[Beaconing C2 (Kunai)]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */4 * * * *
description = Détecte une activité de type beaconing basée sur des connexions régulières avec faible variance.
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = index=kunai\
| bin _time span=1m\
| stats count AS req_per_min BY data.socket.src_ip, data.socket.dst_ip, _time\
| stats avg(req_per_min) AS avg stdev(req_per_min) AS sd BY data.socket.src_ip, data.socket.dst_ip\
| where avg > 3 AND sd < 1

[Création d'une tâche plannifiée]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -2m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=*\
(EventCode=4698 OR EventCode=106 OR EventCode=140)\
| table _time host TaskName Author Command

[Détection de commandes de téléchargement suspectes]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
description = Détecte les téléchargements de malware, les outils distants, les scripts et les payloads
dispatch.earliest_time = -2m
dispatch.latest_time = now
display.page.search.mode = verbose
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=kunai (\
    data.command_line="wget*"\
    OR data.command_line="curl*"\
)

[Kerberoasting Activity - Initial Query]
action.list = 1
action.list.severity = 3
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/splunk-test/alert
alert.digest_mode = 0
alert.expires = 5d
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 1
counttype = number of events
cron_schedule = */4 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* source="WinEventLog:Security" AND ((EventCode="4769" AND Status="0x0" AND TicketEncryptionType="0x17") AND NOT ((ServiceName="*krbtgt" OR ServiceName="*$") OR TargetUserName="*$@*"))

[Potential AS-REP Roasting via Kerberos TGT Requests]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* source="WinEventLog:Security" AND (EventCode="4768" AND TicketEncryptionType="0x17" AND ServiceName="krbtgt" AND PreAuthType="0")

[Scan de port horizontal (Kunai)]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */4 * * * *
description = Détecte un scan de port horizontal basé sur de multiples ports scannés sur une même machine.
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = index=*\
| stats dc(data.socket.dst_port) AS ports_scanned BY data.socket.src_ip, data.socket.dst_ip\
| where ports_scanned > 20

[Scan de port vertical (Kunai)]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */4 * * * *
description = Détecte un scan vertical lorsque le même port est scanné sur plusieurs hôtes.
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = index=*\
| stats dc(data.socket.dst_ip) AS hosts_touched BY data.socket.src_ip, data.socket.dst_port\
| where hosts_touched > 10

[Suspicious Kerberos RC4 Ticket Encryption]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -2m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* source="WinEventLog:Security" AND ((EventCode="4769" AND TicketOptions="0x40810000" AND TicketEncryptionType="0x17") AND NOT ServiceName="*$")

[Utilisation anormale du compte UID 0]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
description = Détecte l’exécution de commandes utilisant l’UID 0 par un utilisateur différent de root.
dispatch.earliest_time = -2m
dispatch.latest_time = now
display.page.search.mode = verbose
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=kunai "\"uid\":0" NOT "\"user\":\"root\""

[Activité de password looting]
action.list = 1
action.list.severity = 5
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.digest_mode = false
alert.expires = 5d
alert.severity = 5
alert.suppress = false
alert.suppress.period = 60s
alert.track = true
counttype = number of events
cron_schedule = */1 * * * *
description = Déclenche si un utilisateur autre que root accède à un fichier sensible de mdp
dispatch.earliest_time = -2m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=kunai data.command_line IN ( "cat /etc/shadow", "cat /etc/passwd", "grep -E '^root|password' /etc/shadow", "unshadow /etc/passwd /etc/shadow", "strings /etc/shadow", "cat /etc/security/opasswd", "cat /etc/pam.d/system-auth", "cat /etc/pam.d/common-password" )

[Détection – Création de service suspect (EventCode 7045)]
action.email = 1
action.email.inline = 1
action.email.message.alert = The alert condition for Création d'un service was triggered.
action.email.sendresults = 1
action.email.subject.alert = Splunk Alert: Création d'un service
action.email.to = yasserguerram@gmail.com
action.email.useNSSubject = 1
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.digest_mode = 0
alert.expires = 5d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
description = Détecte la création d’un service Windows potentiellement malveillant (EventCode 7045), notamment lorsque le binaire associé est anormal (ex: cmd.exe, powershell.exe, répertoires inhabituels ou nom suspect).
dispatch.earliest_time = -2m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index IN (windows_server, windows_client, windows_dc, sysmon)\
EventCode=7045 OR signature_id=7045\
| rename ServiceName as service_name ImagePath as image_path AccountName as account userID as security_id\
| eval service_lower=lower(service_name), image_lower=lower(image_path)\
| where NOT like(service_lower, "%microsoft%")\
| where NOT like(image_lower, "%system32%svchost.exe%")\
| table _time host service_name image_path account StartType EventCode

[Password spraying]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -2m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* source="*"\
| regex _raw="(?i)dsacls\.exe"\
| regex _raw="/user:"\
| regex _raw="/passwd:"

[Multiples commandes d’énumération]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.digest_mode = 0
alert.expires = 5d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */4 * * * *
description = - On recherche les commandes d’énumération.\
- Si un utilisateur exécute >5 commandes suspectes, on alerte.
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=kunai\
(data.command_line="whoami"\
 OR data.command_line="id"\
 OR data.command_line="hostname"\
 OR data.command_line="uname*"\
 OR data.command_line="ifconfig"\
 OR data.command_line="ip addr show"\
 OR data.command_line="ip -4 addr show"\
 OR data.command_line="netstat"\
 OR data.command_line="ss"\
)\
| stats count BY info.task.user\
| where count > 5

[Possible Shadow Credentials Added]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -2m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* source="*" EventCode=5136\
| eval AttributeLDAPDisplayName="msDS-KeyCredentialLink"\
| search AttributeLDAPDisplayName="msDS-KeyCredentialLink"

[Détection AS-REP Roasting]
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 5d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */4 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* source="*" EventCode=4768 PreAuthType=0\
| stats count by TargetUserName, IpAddress\
| where count > 5 AND NOT like(TargetUserName,"%$")

[Dump LSASS]
action.webhook.enable_allowlist = 0
alert.expires = 5d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */4 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" "lsass.exe"

[Détection Kerberoasting]
action.list = 1
action.list.severity = 3
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/splunk-test/alert
alert.digest_mode = 0
alert.expires = 5d
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 1
counttype = number of events
cron_schedule = */4 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* source="*" EventCode=4769\
| eval Enc=coalesce(TicketEncryptionType, Ticket_Encryption_Type)\
| where Enc="0x17" OR Enc="0x12"\
| table _time host Account_Name ServiceName Enc IpAddress